tests/load/resultats-charge-2026-08-18.txt
================================================================================
MESURES DE CHARGE — MyTripCircle — campagne du 18 août 2026
================================================================================

Sorties k6 reproduites TELLES QUELLES, sans retouche des chiffres.

Environnement de la campagne
----------------------------
  • Machine       : macOS (darwin/arm64), Node v25.2.1
  • Outil         : k6 v2.0.0 (/opt/homebrew/bin/k6)
  • API           : node server/index.js, écoute sur http://localhost:4000
  • Base de données : mongod 8.2.6 local, 127.0.0.1:27018, base « mytripcircle_load »
                      (instance locale dédiée à la mesure ; la base MongoDB Atlas
                      de production n'a jamais été sollicitée)
  • Jeu de données : 1 utilisateur avec jeton iCal, 1 abonnement actif,
                     1 voyage, 40 réservations « confirmed »
                     → le flux iCal produit donc 40 événements VEVENT

Scénarios exécutés
------------------
  1. tests/load/calendar.load.js  — profil nominal (sous le limiteur de débit)
  2. tests/load/calendar.load.js  — profil de saturation (limiteur déclenché)
  3. tests/load/itinerary.load.js — TENTATIVE, non exécutable (voir §3)


================================================================================
§1 — FLUX SORTANT iCal — PROFIL NOMINAL
Commande :
  k6 run -e CALENDAR_TOKEN=<64 caractères hexadécimaux> tests/load/calendar.load.js
Profil : 1 VU, cadence 2,5 s (≈ 24 req/min, sous les 30 req/min du limiteur)
Code de sortie k6 : 0 (tous les seuils tenus)
================================================================================

  █ THRESHOLDS 

    calendar_duration
    ✓ 'p(95)<700' p(95)=20.08ms

    calendar_payload_bytes
    ✓ 'min>50' min=13583

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 176     1.588485/s
    checks_succeeded...: 100.00% 176 out of 176
    checks_failed......: 0.00%   0 out of 176

    ✓ status est 200
    ✓ content-type text/calendar
    ✓ flux iCal bien formé
    ✓ réponse < 700ms

    CUSTOM
    calendar_duration..............: avg=15.32ms min=6.23ms med=16.16ms max=25.04ms p(90)=19.24ms p(95)=20.08ms
    calendar_payload_bytes.........: avg=13583   min=13583  med=13583   max=13583   p(90)=13583   p(95)=13583  
    calendar_vevent_count..........: avg=40      min=40     med=40      max=40      p(90)=40      p(95)=40     

    HTTP
    http_req_duration..............: avg=15.18ms min=6.23ms med=16.12ms max=25.04ms p(90)=19.19ms p(95)=20.06ms
      { expected_response:true }...: avg=15.18ms min=6.23ms med=16.12ms max=25.04ms p(90)=19.19ms p(95)=20.06ms
    http_req_failed................: 0.00%  0 out of 45
    http_reqs......................: 45     0.406147/s

    EXECUTION
    iteration_duration.............: avg=2.51s   min=2.5s   med=2.51s   max=2.52s   p(90)=2.52s   p(95)=2.52s  
    iterations.....................: 44     0.397121/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 662 kB 6.0 kB/s
    data_sent......................: 6.4 kB 58 B/s



running (1m50.8s), 0/1 VUs, 44 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m50s

================================================================================
§2 — FLUX SORTANT iCal — PROFIL DE SATURATION DU LIMITEUR
Commande :
  k6 run -e CALENDAR_TOKEN=<64 caractères hexadécimaux> -e VUS=5 -e SLEEP=1 \
    tests/load/calendar.load.js
Profil : 5 VUs, cadence 1 s (≈ 300 req/min, au-dessus des 30 req/min du limiteur)
Code de sortie k6 : 99 — attendu : le seuil http_req_failed est volontairement
dépassé puisque les 429 du limiteur sont comptés comme des réponses non-2xx.
C'est ici la démonstration que la protection anti-abus fonctionne, pas un défaut.
================================================================================

  █ THRESHOLDS 

    calendar_duration
    ✓ 'p(95)<700' p(95)=25.85ms

    calendar_payload_bytes
    ✓ 'min>50' min=13583

    http_req_failed
    ✗ 'rate<0.01' rate=86.17%


  █ TOTAL RESULTS 

    checks_total.......: 1732   15.708811/s
    checks_succeeded...: 35.21% 610 out of 1732
    checks_failed......: 64.78% 1122 out of 1732

    ✗ status est 200
      ↳  13% — ✓ 59 / ✗ 374
    ✗ content-type text/calendar
      ↳  13% — ✓ 59 / ✗ 374
    ✗ flux iCal bien formé
      ↳  13% — ✓ 59 / ✗ 374
    ✓ réponse < 700ms

    CUSTOM
    calendar_429_rate_limited......: 374    3.392087/s
    calendar_duration..............: avg=15.41ms min=4.37ms med=13.15ms max=104.59ms p(90)=19.27ms p(95)=25.85ms
    calendar_payload_bytes.........: avg=13583   min=13583  med=13583   max=13583    p(90)=13583   p(95)=13583  
    calendar_vevent_count..........: avg=40      min=40     med=40      max=40       p(90)=40      p(95)=40     

    HTTP
    http_req_duration..............: avg=5.6ms   min=281µs  med=2.54ms  max=104.59ms p(90)=15.3ms  p(95)=19.02ms
      { expected_response:true }...: avg=16.21ms min=4.37ms med=13.16ms max=104.59ms p(90)=19.73ms p(95)=34.48ms
    http_req_failed................: 86.17% 374 out of 434
    http_reqs......................: 434    3.936272/s

    EXECUTION
    iteration_duration.............: avg=1s      min=1s     med=1s      max=1.11s    p(90)=1.01s   p(95)=1.02s  
    iterations.....................: 433    3.927203/s
    vus............................: 1      min=1          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 1.3 MB 12 kB/s
    data_sent......................: 62 kB  563 B/s



running (1m50.3s), 0/5 VUs, 433 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  1m50s
time="2026-08-18T12:32:28+02:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"

================================================================================
§3 — FLUX /itinerary/generate — TENTATIVE D'EXÉCUTION, ÉCHEC DOCUMENTÉ
Commande :
  k6 run -e EMAIL=<compte de test local> -e PASSWORD=<mot de passe> \
    tests/load/itinerary.load.js
Code de sortie k6 : 107 (exception dans setup())

Cause exacte : la variable GROQ_API_KEY est commentée dans le fichier .env local.
server/routes/itinerary.js renvoie alors 503 { error: "ai_not_configured" } et le
setup() du scénario s'interrompt volontairement (fail fast) plutôt que de produire
une campagne qui ne mesurerait rien. Le POST /users/login a bien répondu 200 :
seule l'absence de clé du fournisseur de modèle bloque la mesure.
AUCUN chiffre de latence n'est donc disponible pour cette route à cette date.
================================================================================

  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.01' rate=50.00%

    itinerary_cold_duration
    ✓ 'p(95)<20000' p(95)=0s

    itinerary_warm_duration
    ✓ 'p(95)<800' p(95)=0s


  █ TOTAL RESULTS 

    CUSTOM
    itinerary_cold_duration........: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    itinerary_warm_duration........: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      

    HTTP
    http_req_duration..............: avg=96.51ms  min=4.27ms   med=96.51ms  max=188.75ms p(90)=170.3ms  p(95)=179.52ms
      { expected_response:true }...: avg=188.75ms min=188.75ms med=188.75ms max=188.75ms p(90)=188.75ms p(95)=188.75ms
    http_req_failed................: 50.00% 1 out of 2
    http_reqs......................: 2      9.064581/s

    NETWORK
    data_received..................: 2.6 kB 12 kB/s
    data_sent......................: 562 B  2.5 kB/s



Run       [ 100% ] setup()
default   [   0% ]
time="2026-08-18T12:30:25+02:00" level=error msg="Error: GROQ_API_KEY absente côté serveur (503 ai_not_configured) : le scénario ne mesurerait rien.\n\tat setup (file:///Users/enzo.turpin/Desktop/MyTripCircle-copie/tests/load/itinerary.load.js:184:11(82))\n" hint="script exception"